#### INTODUCTION TO PANDAS AND DATA MANIPULATION
* Official Documentation: https://pandas.pydata.org/docs/
* Youtube Reference: https://youtu.be/RnFGwxJwx-0?t=4025

In [65]:
# import 'pandas' package
import pandas as pd

In [66]:
# to read csv file
df = pd.read_csv("Uber_Drives.csv")

Some useful attributes and methods

In [67]:
df.dtypes

START_DATE*     object
END_DATE*       object
CATEGORY*       object
START*          object
STOP*           object
MILES*         float64
PURPOSE*        object
dtype: object

In [68]:
df.info

<bound method DataFrame.info of            START_DATE*         END_DATE* CATEGORY*            START*  \
0       1/1/2016 21:11    1/1/2016 21:17  Business       Fort Pierce
1        1/2/2016 1:25     1/2/2016 1:37  Business       Fort Pierce
2       1/2/2016 20:25    1/2/2016 20:38  Business       Fort Pierce
3       1/5/2016 17:31    1/5/2016 17:45  Business       Fort Pierce
4       1/6/2016 14:42    1/6/2016 15:49  Business       Fort Pierce
...                ...               ...       ...               ...
1151  12/31/2016 13:24  12/31/2016 13:42  Business           Karachi
1152  12/31/2016 15:03  12/31/2016 15:38  Business  Unknown Location
1153  12/31/2016 21:32  12/31/2016 21:50  Business        Katunayake
1154  12/31/2016 22:08  12/31/2016 23:51  Business           Gampaha
1155            Totals               NaN       NaN               NaN

                 STOP*   MILES*         PURPOSE*
0          Fort Pierce      5.1   Meal/Entertain
1          Fort Pierce      5.0              NaN
2          Fort Pierce      4.8  Errand/Supplies
3          Fort Pierce      4.7          Meeting
4      West Palm Beach     63.7   Customer Visit
...                ...      ...              ...
1151  Unknown Location      3.9   Temporary Site
1152  Unknown Location     16.2          Meeting
1153           Gampaha      6.4   Temporary Site
1154         Ilukwatta     48.2   Temporary Site
1155               NaN  12204.7              NaN

[1156 rows x 7 columns]>

In [69]:
df.columns

Index(['START_DATE*', 'END_DATE*', 'CATEGORY*', 'START*', 'STOP*', 'MILES*',
       'PURPOSE*'],
      dtype='object')

In [70]:
df.head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [71]:
df.tail()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Karachi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

In [72]:
df.describe()

             MILES*
count   1156.000000
mean      21.115398
std      359.299007
min        0.500000
25%        2.900000
50%        6.000000
75%       10.400000
max    12204.700000

In [73]:
# to convert date string to datetime type
df['START_DATE*'] = pd.to_datetime(df['START_DATE*'], errors='coerce')
df['END_DATE*'] = pd.to_datetime(df['END_DATE*'], errors='coerce')

print(df['START_DATE*'].dtypes)
print(df['END_DATE*'].dtypes)

datetime64[ns]
datetime64[ns]

FILTERATION
* miles > 10miles
* originating from Cary to Durham

In [74]:
# Example-1
e_1 = df[(df['MILES*']>10) & ((df['START*'] == 'Cary') & (df['STOP*'] == 'Durham'))]
e_1.head(n=10)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
28,2016-01-15 11:43:00,2016-01-15 12:03:00,Business,Cary,Durham,10.4,Meal/Entertain
55,2016-01-29 11:43:00,2016-01-29 12:03:00,Business,Cary,Durham,10.4,Meeting
74,2016-02-05 11:47:00,2016-02-05 12:07:00,Business,Cary,Durham,10.4,Meeting
164,2016-02-26 11:35:00,2016-02-26 11:59:00,Business,Cary,Durham,10.6,Meeting
185,2016-03-04 11:46:00,2016-03-04 12:06:00,Business,Cary,Durham,10.4,Meeting
304,2016-04-08 12:30:00,2016-04-08 12:48:00,Business,Cary,Durham,10.5,Meeting
325,2016-04-22 12:08:00,2016-04-22 12:28:00,Business,Cary,Durham,10.4,Meeting
339,2016-04-29 18:46:00,2016-04-29 19:18:00,Business,Cary,Durham,14.2,Customer Visit
394,2016-06-03 11:29:00,2016-06-03 11:49:00,Business,Cary,Durham,10.4,Meeting
411,2016-06-06 21:41:00,2016-06-06 22:00:00,Business,Cary,Durham,10.4,Meeting

In [75]:
# Example-2
e_2 = df.loc[(df['MILES*']>10) & ((df['START*'] == 'Cary') & (df['STOP*'] == 'Durham'))]
e_2.head(n=10)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
28,2016-01-15 11:43:00,2016-01-15 12:03:00,Business,Cary,Durham,10.4,Meal/Entertain
55,2016-01-29 11:43:00,2016-01-29 12:03:00,Business,Cary,Durham,10.4,Meeting
74,2016-02-05 11:47:00,2016-02-05 12:07:00,Business,Cary,Durham,10.4,Meeting
164,2016-02-26 11:35:00,2016-02-26 11:59:00,Business,Cary,Durham,10.6,Meeting
185,2016-03-04 11:46:00,2016-03-04 12:06:00,Business,Cary,Durham,10.4,Meeting
304,2016-04-08 12:30:00,2016-04-08 12:48:00,Business,Cary,Durham,10.5,Meeting
325,2016-04-22 12:08:00,2016-04-22 12:28:00,Business,Cary,Durham,10.4,Meeting
339,2016-04-29 18:46:00,2016-04-29 19:18:00,Business,Cary,Durham,14.2,Customer Visit
394,2016-06-03 11:29:00,2016-06-03 11:49:00,Business,Cary,Durham,10.4,Meeting
411,2016-06-06 21:41:00,2016-06-06 22:00:00,Business,Cary,Durham,10.4,Meeting

In [76]:
# Example-3
e_3 = df.loc[(df['MILES*']>10) & ((df['START*'] == 'Cary') & (df['STOP*'] == 'Durham')), ['START_DATE*', 'END_DATE*']]
e_3.head(n=10)

            START_DATE*           END_DATE*
28  2016-01-15 11:43:00 2016-01-15 12:03:00
55  2016-01-29 11:43:00 2016-01-29 12:03:00
74  2016-02-05 11:47:00 2016-02-05 12:07:00
164 2016-02-26 11:35:00 2016-02-26 11:59:00
185 2016-03-04 11:46:00 2016-03-04 12:06:00
304 2016-04-08 12:30:00 2016-04-08 12:48:00
325 2016-04-22 12:08:00 2016-04-22 12:28:00
339 2016-04-29 18:46:00 2016-04-29 19:18:00
394 2016-06-03 11:29:00 2016-06-03 11:49:00
411 2016-06-06 21:41:00 2016-06-06 22:00:00

RESET INDEXING

In [77]:
# to reset index w/o changing original df
# you need to store it in new variable
v_1 = e_1.reset_index()
v_1.head(n=10)

,index,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,28,2016-01-15 11:43:00,2016-01-15 12:03:00,Business,Cary,Durham,10.4,Meal/Entertain
1,55,2016-01-29 11:43:00,2016-01-29 12:03:00,Business,Cary,Durham,10.4,Meeting
2,74,2016-02-05 11:47:00,2016-02-05 12:07:00,Business,Cary,Durham,10.4,Meeting
3,164,2016-02-26 11:35:00,2016-02-26 11:59:00,Business,Cary,Durham,10.6,Meeting
4,185,2016-03-04 11:46:00,2016-03-04 12:06:00,Business,Cary,Durham,10.4,Meeting
5,304,2016-04-08 12:30:00,2016-04-08 12:48:00,Business,Cary,Durham,10.5,Meeting
6,325,2016-04-22 12:08:00,2016-04-22 12:28:00,Business,Cary,Durham,10.4,Meeting
7,339,2016-04-29 18:46:00,2016-04-29 19:18:00,Business,Cary,Durham,14.2,Customer Visit
8,394,2016-06-03 11:29:00,2016-06-03 11:49:00,Business,Cary,Durham,10.4,Meeting
9,411,2016-06-06 21:41:00,2016-06-06 22:00:00,Business,Cary,Durham,10.4,Meeting

In [78]:
# to reset index and replace with the original df
# set 'True' for 'inplace'
e_2.reset_index(inplace=True)

In [79]:
# to remove the index column 
# set 'True' for 'drop'
e_2.reset_index(drop=True)
e_2.head(n=10)

,index,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,28,2016-01-15 11:43:00,2016-01-15 12:03:00,Business,Cary,Durham,10.4,Meal/Entertain
1,55,2016-01-29 11:43:00,2016-01-29 12:03:00,Business,Cary,Durham,10.4,Meeting
2,74,2016-02-05 11:47:00,2016-02-05 12:07:00,Business,Cary,Durham,10.4,Meeting
3,164,2016-02-26 11:35:00,2016-02-26 11:59:00,Business,Cary,Durham,10.6,Meeting
4,185,2016-03-04 11:46:00,2016-03-04 12:06:00,Business,Cary,Durham,10.4,Meeting
5,304,2016-04-08 12:30:00,2016-04-08 12:48:00,Business,Cary,Durham,10.5,Meeting
6,325,2016-04-22 12:08:00,2016-04-22 12:28:00,Business,Cary,Durham,10.4,Meeting
7,339,2016-04-29 18:46:00,2016-04-29 19:18:00,Business,Cary,Durham,14.2,Customer Visit
8,394,2016-06-03 11:29:00,2016-06-03 11:49:00,Business,Cary,Durham,10.4,Meeting
9,411,2016-06-06 21:41:00,2016-06-06 22:00:00,Business,Cary,Durham,10.4,Meeting

SORTING

In [80]:
# Example-1
df.sort_values(by='MILES*', ascending=True).head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
420,2016-06-08 17:16:00,2016-06-08 17:18:00,Business,Soho,Tribeca,0.5,Errand/Supplies
44,2016-01-26 17:27:00,2016-01-26 17:29:00,Business,Cary,Cary,0.5,Errand/Supplies
120,2016-02-17 16:38:00,2016-02-17 16:43:00,Business,Katunayaka,Katunayaka,0.5,Errand/Supplies
1111,2016-12-25 00:10:00,2016-12-25 00:14:00,Business,Lahore,Lahore,0.6,Errand/Supplies
1110,2016-12-24 22:04:00,2016-12-24 22:09:00,Business,Lahore,Lahore,0.6,Errand/Supplies

In [81]:
# Example-2
df.sort_values(by=['CATEGORY*', 'MILES*'], ascending=[False, False]).head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
559,2016-07-17 12:20:00,2016-07-17 15:25:00,Personal,Boone,Cary,180.2,Commute
554,2016-07-16 15:29:00,2016-07-16 16:57:00,Personal,Newland,Boone,41.9,NaN
552,2016-07-16 13:14:00,2016-07-16 14:10:00,Personal,Banner Elk,Newland,28.1,NaN
280,2016-03-28 19:30:00,2016-03-28 20:23:00,Personal,Couples Glen,Vista East,27.2,NaN
281,2016-03-28 22:55:00,2016-03-28 23:26:00,Personal,Orlando,Kissimmee,25.7,NaN